support = {
        'race':{
                'Человек':{
                    'att':{
                        'str':'3',
                        'agi':'3',
                        'int':'3',
                        'body':'3'
                        },
                    'percs':{
                        'learning':'1'
                        },
                    'startLVL':'1',
                    'tooltip':'Люди — самая распространенная раса.\nБольшинство поселений населены людьми, соответственно, сложно встретить проблемы из-за расовых предрассудков. Общаются на Общем языке, однако, могут выучить язык Альдеров – Первых людей, канувшей в лету более старшей подрасы, имевшей связи с эльфами и перенявшей тягу к магии. На языке альдеров можно читать древние трактаты и перенимать знания. Трактаты альдеров связаны с изучением магии.\nЛюди склонны к странствиям, пытливости, изучению мира и торговле.\nЛюди получают +3 к Силе, Ловкости, Разуму и Телосложению. Не имеют штраф к опыту.\nТакже они получают +1 к Обучаемости.',
                    'language':['Общий']
                    },
                'Гном':{
                    'att':{
                        'str':'5',
                        'agi':'4',
                        'int':'1',
                        'body':'5'
                        },
                    'percs':{
                        'magicResist':'1',
                        'magicArmor':'1'
                        },
                    'startLVL':'4',
                    'tooltip':'Гномы — древняя раса.\nПредставлена как замкнутыми гномами-консерваторами, приверженцами старых традиций, так и гномами-наемниками более вольных взглядов. В наемничьей среде передняя линия гномской пехоты считается несокрушимей крепостной стены.\nВладеют Общим и Гномским языком. На языке гномов можно читать древние трактаты и перенимать знания. Трактаты гномов связаны с военным ремеслом.\nГномы ненавидят как орков, так и своих собратьев-тёмных гномов, извращенных тьмой подземных глубин. Хранитель Ключей Цитадели объявил, что не успокоится, пока тёмные гномы не исчезнут из Стигии.\nГномы получают +5 к Силе, +4 к Ловкости, +1 к Разуму и +5 к Телосложению. Также они имеют +1 сопротивление магии и +1 броня от магии, однако магами — быть не могут. Имеют штраф по опыту: начинают с 4 уровня.',
                    'language':['Общий','Гномий']
                    },
                'Лесной Эльф':{
                    'att':{
                        'str':'4',
                        'agi':'4',
                        'int':'4',
                        'body':'4'
                        },
                    'percs':{
                        'shoot':'1'
                        },
                    'startLVL':'4',
                    'tooltip':'Эльфы — традиционно самая долгоживущая и одарённая раса.\nВ Стигии есть поселение лесных эльфов, избравших как путь служения лесу, так и путь приключений. Также есть башня высших эльфов – как они сами себя называют. Они замкнуты и моносоциальны, с высокомерием относятся к другим расам и даже к лесным собратьям, обладают безграничными запасами знаний и мудрости. Высшие эльфы неохотно делятся своими секретами, и потому для их представителей выход из Башни навстречу приключениям – почти всегда становится дорогой без возврата.\nВладеют Общим и Эльфийским языком. На языке эльфов можно читать древние трактаты и перенимать знания. Изысканные трактаты эльфов связаны и с военным ремеслом, и с магией.\nЛесные эльфы получают +4 к Силе, Ловкости, Разуму и Телосложению. Также, на старте имеют +1 к Стрельбе. Их одаренность приводит к штрафу по опыту: начинают с 4 уровня.',
                    'language':['Общий','Эльфиский']
                    },
                'Высший эльф':{
                    'att':{
                        'str':'5',
                        'agi':'5',
                        'int':'5',
                        'body':'5'
                        },
                    'percs':{
                        'nothing':'1'
                        },
                    'startLVL':'8',
                    'tooltip':'Эльфы — традиционно самая долгоживущая и одарённая раса.\nВ Стигии есть поселение лесных эльфов, избравших как путь служения лесу, так и путь приключений. Также есть башня высших эльфов – как они сами себя называют. Они замкнуты и моносоциальны, с высокомерием относятся к другим расам и даже к лесным собратьям, обладают безграничными запасами знаний и мудрости. Высшие эльфы неохотно делятся своими секретами, и потому для их представителей выход из Башни навстречу приключениям – почти всегда становится дорогой без возврата.\nВладеют Общим и Эльфийским языком. На языке эльфов можно читать древние трактаты и перенимать знания. Изысканные трактаты эльфов связаны и с военным ремеслом, и с магией.\nВысшие эльфы получают +5 к Силе, Ловкости, Разуму и Телосложению. Их одаренность приводит к штрафу по опыту: начинают с 8 уровня.',
                    'language':['Общий','Эльфиский']
                    },
                'Орки':{
                    'att':{
                        'str':'5',
                        'agi':'1',
                        'int':'1',
                        'body':'5'
                        },
                    'percs':{
                        'Attack':'1' # two handed weapons
                        },
                    'startLVL':'1',
                    'tooltip':'Орки – раса могучих воинов.\nЭта раса проигрывала войны лишь из-за своей малочисленности. Большинство относится к оркам предвзято из-за их устрашающего вида, а также, низкого интеллекта и примитивных культурных традиций. Однако, они ценятся как отличные наемники. В среде наемников если гномы – символ несокрушимой обороны, то орки – отчаянные рубаки, с которыми не хочется встретиться лицом к лицу в равном числе. Орки Араката недолюбливают гномов, а также кровожадных сородичей, занимающихся грабежом и мародёрством.\nВладеют Общим и Орочьим языком. На языке орков, который лишь с виду кажется простым, можно читать древние трактаты и перенимать знания. Трактаты орков связаны с военным ремеслом.\nОрки получают +5 к Силе, +1 к Ловкости, +1 к Разуму и +5 к Телосложению. Также, при использовании двуручного оружия ближнего боя имеют +1 к атаке и урону. Не имеют штраф к опыту.',
                    'language':['Общий','Орочий']
                    },
                'Планар Воздуха':{
                    'att':{
                        'str':'3',
                        'agi':'3',
                        'int':'4',
                        'body':'4'
                        },
                    'percs':{
                        'windDamage':'1'
                        },
                    'startLVL':'4',
                    'tooltip':'Планары – самая редкая раса.\nПо мнению исследователей, время от времени в мире происходит коллапс от воздействий всплеска стихийной силы, через такие явления, как прорыв Стихийных Планов или схождение Планов (всего стихийных планов 4 – Огонь, Вода, Воздух, Земля). При таких явлениях стихийная энергия проникает в тела существ, и её может оказаться достаточно, чтобы в качестве потомства от двух простых смертных появился планар. Эта раса стремится жить в гармонии с миром, поэтому, несмотря на происхождение и оттенок кожи, большинство представителей других рас их не боятся и уважают.\nПланары воздуха редко остаются в одном месте на долгое время, и всегда находятся в поиске чего-то нового, торопятся жить. Предпочитают открытые земли, такие как равнины, пустыни и высокие горы. Имеют светло-белый оттенок кожи. Чувствуют себя плохо в закрытых помещениях, пещерах и подземельях, получая -3 ХП каждый день на глобальной карте. Получают лишь 50% урона магией, связанной с его стихией, однако на 50% больше урона стихией Огня.\nВладеют Общим и Планарным языком. На языке планаров можно читать древние трактаты и перенимать знания. Трактаты планаров связаны с изучением магии.\nПланары получают +3 к Силе, Ловкости и +4 к Разуму и Телосложению. Также, они имеют следующие способности:\n· Сопротивление и уязвимость к стихийному урону (описано выше)\n· Находясь вблизи родной стихии, планар к любому наносимому им урону добавляет 1 урона своей стихией.\nОдаренность планаров приводит к штрафу по опыту: начинают с 4 уровня.',
                    'language':['Общий','Планарный']
                    },
                'Планар Земли':{
                    'att':{
                        'str':'3',
                        'agi':'3',
                        'int':'4',
                        'body':'4'
                        },
                    'percs':{
                        'earthDamage':'1'
                        },
                    'startLVL':'4',
                    'tooltip':'Планары – самая редкая раса.\nПо мнению исследователей, время от времени в мире происходит коллапс от воздействий всплеска стихийной силы, через такие явления, как прорыв Стихийных Планов или схождение Планов (всего стихийных планов 4 – Огонь, Вода, Воздух, Земля). При таких явлениях стихийная энергия проникает в тела существ, и её может оказаться достаточно, чтобы в качестве потомства от двух простых смертных появился планар. Эта раса стремится жить в гармонии с миром, поэтому, несмотря на происхождение и оттенок кожи, большинство представителей других рас их не боятся и уважают.\nПланары земли более замкнуты; их связь с землёй приводит к тому, что многие живут в подземельях, где они чувствуют себя комфортно. Когда они выходят из своих пещер, они могут бродить по холмам и горам или могут предъявить права на старые руины. Имеют землистый оттенок кожи. Чувствуют себя плохо в городах и неестественном окружении, получая -3 ХП каждый день на глобальной карте. Получают лишь 50% урона магией, связанной с его стихией, однако на 50% больше урона стихией Воздуха.\nВладеют Общим и Планарным языком. На языке планаров можно читать древние трактаты и перенимать знания. Трактаты планаров связаны с изучением магии.\nПланары получают +3 к Силе, Ловкости и +4 к Разуму и Телосложению. Также, они имеют следующие способности:\n· Сопротивление и уязвимость к стихийному урону (описано выше)\n· Находясь вблизи родной стихии, планар к любому наносимому им урону добавляет 1 урона своей стихией.\nОдаренность планаров приводит к штрафу по опыту: начинают с 4 уровня.',
                    'language':['Общий','Планарный']
                    },
                'Планар Огня':{
                    'att':{
                        'str':'3',
                        'agi':'3',
                        'int':'4',
                        'body':'4'
                        },
                    'percs':{
                        'fireDamage':'1'
                        },
                    'startLVL':'4',
                    'tooltip':'Планары – самая редкая раса.\nПо мнению исследователей, время от времени в мире происходит коллапс от воздействий всплеска стихийной силы, через такие явления, как прорыв Стихийных Планов или схождение Планов (всего стихийных планов 4 – Огонь, Вода, Воздух, Земля). При таких явлениях стихийная энергия проникает в тела существ, и её может оказаться достаточно, чтобы в качестве потомства от двух простых смертных появился планар. Эта раса стремится жить в гармонии с миром, поэтому, несмотря на происхождение и оттенок кожи, большинство представителей других рас их не боятся и уважают.\nПланары огня часто попадают в неприятности из-за своего вспыльчивого характера. Чувствуют себя плохо возле обширных водных пространств и снегов, получая -3 ХП каждый день на глобальной карте. Имеют красный оттенок кожи. Получают лишь 50% урона магией, связанной с его стихией, однако на 50% больше урона стихией Воды.\nВладеют Общим и Планарным языком. На языке планаров можно читать древние трактаты и перенимать знания. Трактаты планаров связаны с изучением магии.\nПланары получают +3 к Силе, Ловкости и +4 к Разуму и Телосложению. Также, они имеют следующие способности:\n· Сопротивление и уязвимость к стихийному урону (описано выше)\n· Находясь вблизи родной стихии, планар к любому наносимому им урону добавляет 1 урона своей стихией.\nОдаренность планаров приводит к штрафу по опыту: начинают с 4 уровня.',
                    'language':['Общий','Планарный']
                    },
                'Планар Воды':{
                    'att':{
                        'str':'3',
                        'agi':'3',
                        'int':'4',
                        'body':'4'
                        },
                    'percs':{
                        'waterDamage':'1'
                        },
                    'startLVL':'4',
                    'tooltip':'Планары – самая редкая раса.\nПо мнению исследователей, время от времени в мире происходит коллапс от воздействий всплеска стихийной силы, через такие явления, как прорыв Стихийных Планов или схождение Планов (всего стихийных планов 4 – Огонь, Вода, Воздух, Земля). При таких явлениях стихийная энергия проникает в тела существ, и её может оказаться достаточно, чтобы в качестве потомства от двух простых смертных появился планар. Эта раса стремится жить в гармонии с миром, поэтому, несмотря на происхождение и оттенок кожи, большинство представителей других рас их не боятся и уважают.\nПланары воды становятся отличными моряками и рыбаками, предпочитают тихие, уединённые места: широкие берега естественных водоёмов. Чувствуют себя плохо в пустыне и пустошах без источников воды, получая -3 ХП каждый день на глобальной карте. Имеют синий оттенок кожи. Получают лишь 50% урона магией, связанной с его стихией, однако на 50% больше урона стихией Земли.\nВладеют Общим и Планарным языком. На языке планаров можно читать древние трактаты и перенимать знания. Трактаты планаров связаны с изучением магии.\nПланары получают +3 к Силе, Ловкости и +4 к Разуму и Телосложению. Также, они имеют следующие способности:\n· Сопротивление и уязвимость к стихийному урону (описано выше)\n· Находясь вблизи родной стихии, планар к любому наносимому им урону добавляет 1 урона своей стихией.\nОдаренность планаров приводит к штрафу по опыту: начинают с 4 уровня.',
                    'language':['Общий','Планарный']
                    }
                },
        'attributes':{
            'Сила':{
                'Ближний бой':{
                    'tooltip':'+1 к физическому урону в ближнем бою, доступ к использованию рукопашного оружия более высокого качества'
                },
                'Стрельба':{
                    'tooltip':'+1 к физическому урону в дальнем бою, доступ к использованию оружия дальнего боя более высокого качества'
                },
                'Мощные удары':{
                    'tooltip':'в ближнем бою сильный удар имеет +2 к урону/+1 к игнору брони'
                },
                'Ратное дело':{
                    'tooltip':'доступ к использованию всех видов щитов, брони более высокого качества'
                },
                'Тактика':{
                    'tooltip':'грамотное тактическое построение позволяет:\n- в 1-м ходу добавить +1 скорости всей группе (не влияет на бонус 2-ного хода для 11+ скорости)\n- для всех членов группы +1 к броску при попытке сбежать из боя\n- до начала боя +1 применение заклинаний (бафф/погода/призыв) и усилений'
                }
            },
            'Ловкость':{
                'Атака':{
                    'tooltip':'+1 к атаке в ближнем и дальнем бою. При броске = 6 автопопадание, равно как и при броске 1 = автопромах'
                },
                'Уклонение':{
                    'tooltip':'+1 к шансу увернуться от атаки в ближнем и дальнем бою'
                },
                'Скорость':{
                    'tooltip':'очерёдность ходов в бою. При скорости 11 и выше – 2 хода'
                },
                'Хладнокровие':{
                    'tooltip':'игрок может перебросить кубик, связанный с действиями физического характера. Примечание: распространяется на боевые (атака, уклонение, сопротивление магии, урон Внезапного удара) и на небоевые действия (диалоги, крафт, воровское дело и т.п). Число рангов определяет количество применений за глобальный ход, в т.ч. все бои в этом ходу'
                },
                'Воровское дело':{
                    'tooltip':'кража/взлом замка/обезвреживание ловушки. Навык против уровня цели с броском d6. Число применений способности в течение хода не ограничено, но каждая следующая попытка усложняется на -2 к броску.\nПример: проверка кражи происходит следующим образом — игрок делает проверку навыка против уровень цели с броском d6. Если он перебросил цель, то получает навар. Если бросок неудачный, то вора раскрыли — его запомнят (и в этом месте воровать уже будет нельзя), но он может сбросить кубик еще раз, чтобы избежать последствий. Если и этот бросок неудачен, то игрока скручивают на месте с соответствующими последствиями: либо штраф в размере 3х от украденной суммы, либо срок в тюрьме – в зависимости от суммы украденного, снижается 1-3 параметра'
                }
            },
            'Разум':{
                'Мана':{
                    'tooltip':'+2 к максимуму маны, а также +1 к восстановлению маны после боя'
                },
                'Первая помощь':{
                    'tooltip':'+2 к восстановлению ХП после боя одной цели, цель можно выбирать.\nПримечание: навык может быть у разных игроков, и направлен на 1 цель, исцеление при этом суммируется. К примеру, у Игрока-1 навык прокачан в 2, а у Игрока-2 в 1, значит, после боя, они могут исцелить в сумме 6 ХП одной цели, либо распределить на всех. Если на цель применен навык с суммой рангов = 5, то исцеляются все травмы'
                },
                'Круги магии':{
                    'tooltip':'доступный круг прочтения заклинаний и качества используемых магических книг'
                },
                'Сила магии':{
                    'tooltip':'прямой магический урон и преодоление сопротивления магии +1'
                },
                'Обучаемость':{
                    'tooltip':'+1 к получаемому опыту за квесты, а также, возможность изучения языков.\nПримечание: требуется для чтения обучающих трактатов, особенно требуется начертателям. По умолчанию все знают Общий, с рангами можно познать: альдерский, орочий, гномский, планарный, эльфийский и, наконец, мёртвые языки. Изучение происходит с броском против соответствующей сложности языка'
                }
            },
            'Телосложение':{
                'Здоровье':{
                    'tooltip':'+2 к максимуму ХП, а также +1 к восстановлению ХП после боя'
                },
                'Энергия':{
                    'tooltip':'+1 к Энергии'
                },
                'Сопротивляемость':{
                    'tooltip':'снижает урон от периодического урона на 1 до минимума в 1'
                },
                'Второе дыхание':{
                    'tooltip':'1 раз за бой если ХП падает ниже 50%, то лечит 2 ХП за ранг'
                },
                'Стальное тело':{
                    'tooltip':'при получении смертельного урона герой остается на ногах 1 ход, требуется 1 удар чтобы сразить его окончательно.\nПример 1: У героя стальное тело 1. Против него 2 огра. Огр-1 наносит герою смертельное ранение, начинается эффект Стального тела. Огр-2 также попадает — эффект стального тела снимается, герой умирает, не совершив бонусный ход.\nПример 2: У героя стальное тело 2. Против него 2 огра. Огр-1 наносит герою смертельное ранение, начинается эффект Стального тела. Огр-2 также попадает — стальное тело продолжает действовать (остался еще 1 заряд = 1 удар чтобы добить героя) и герой делает бонусный ход, после чего падает без сил'
                }
            }
        },
        'magic':{
            'Школа тьмы':{
                'Круг 1':{
                    'Оживить мертвеца':{
                        'tooltip':'заклинание/призыв',
                        'level':'1.  Вызов Зомби. Поддержание 1\n2.  Вызов Скелета. Поддержание 1\n3.  Вызов Скелета-воина. Поддержание 1\n4.  Вызов Скелета-рыцаря. Поддержание 1\n5.1 Эльфийский стиль: Вызов Носферату. Поддержание 1\n5.2 Альдерский стиль: Вызов Тёмного лорда. Поддержание 1\n5.3 Планарный стиль: Вызов Элементаля Крови. Поддержание 1'
                    },
                    'Волна смерти':{
                        'tooltip':'заклинание',
                        'level':'1.  1d6 урона одиночной цели\n2.  1d6 урона всем противникам\n3.  До конца боя враги получают по 1 периодического урона Тьмой\n4.  1d10 урона всем противникам\n5.1 Эльфийский стиль: периодический урон Тьмой увеличен до 3\n5.2 Альдерский стиль: за каждого уже убитого в бою Волна смерти наносит на 2 больше прямого урона\n5.3 Планарный стиль: при смерти хотя бы 1 врага – возвращается потраченная мана'
                    }
                },
                'Круг 2':{
                    'Леденящий ужас':{
                        'tooltip':'заклинание',
                        'level':'1.  Цель в страхе пропускает 2 хода, урон снимает эффект\n2.  Ужас действует 3 хода\n3.  Каждый пропущенный ход снижает макс.ХП на 2\n4.  Урон Тьмой не снимает эффект Ужаса\n5.1 Эльфийский стиль: после окончания действия цель сходит с ума и атакует ближайшую цель 1 ход\n5.2 Альдерский стиль: заклинание не развеивается снятием негативных эффектов\n5.3 Планарный стиль: с 50% шансом заклинание накладывается еще на 1 врага'
                    },
                    'Гибельная порча':{
                        'tooltip':'заклинание',
                        'level':'1. Цель получает +2 урона от всех источников до конца\n2.  Цель не может лечиться до конца боя\n3.  С цели снимаются все положительные эффекты\n4.  Цель получает +4 урона от всех источников до конца\n5.1 Эльфийский стиль: атаки по цели «Порчи» не имеют крит.промахов\n5.2 Альдерский стиль: цель «Порчи» при крит.промахе – наносит удар себе\n5.3 Планарный стиль: с 50% шансом заклинание накладывается еще на 1 врага'
                    }
                },
                'Круг 3':{
                    'Щит тьмы':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. На 3 хода для мага и его нежити — защита от Света\n2.  Действует на весь отряд\n3.  Добавляет +3 брони от магии Света до конца боя\n4.1 Эльфийский стиль: прямой урон Тьмой увеличен на 3\n4.2 Альдерский стиль: исцеляющие эффекты  Света снижены на 3\n4.3 Планарный стиль: действует до конца боя'
                    },
                    'Сила мертвых':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. Маг становится нежитью на 3 хода: +3 к Уклонению и Сопротивлению Магии, но получает дополнительный урон от Света +50%\n2.  Пока активно, магия Тьмы стоит на 2 ед. маны дешевле\n3.  Атаки и магия мага приобретают Вампиризм\n4.1 Эльфийский стиль: дополнительно +3 к броне от магии и скорости\n4.2 Альдерский стиль: пока активно, получаемый физ.урон снижен на 50%\n4.3 Планарный стиль: длительность до конца боя'
                    }
                },
                'Круг 4':{
                    'Клинок Несчастья':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. Следующий удар +5 урона Тьмой\n2.  Вампиризм — на доп.урон от зачарования\n3.  Удар рассеивает любые позитивные эффекты\n4.1 Эльфийский стиль: действует на всех членов группы и нежить мага\n4.2 Альдерский стиль: следующий удар +10 урона Тьмой\n4.3 Планарный стиль: длительность до конца боя'
                    },
                    'Ярость проклятых':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. Маг до конца боя дает +3 к урону одной цели-нежити\n2.  Бонус добавляется также к атаке и скорости\n3.  Добавляемый бонус увеличивается до 6\n4.1 Эльфийский стиль: любая нежить мага получает «Вампиризм»\n4.2 Альдерский стиль: если цель - только 1 нежить, то бонус увеличивается до 10\n4.3 Планарный стиль: действует на всю нежить мага'
                    }
                },
                'Круг 5':{
                    'Перст смерти':{
                        'tooltip':'заклинание',
                        'level':'1. Наносит цели урон в размере 50% её макс.запаса ХП\n2.  Игнорирует проверку сопротивления магии и заклинание «Защита от Тьмы»\n3.1 Эльфийский стиль: Наносит цели урон в размере 100% её макс.запаса ХП\n3.2 Альдерский стиль: на выжившую цель накладывается «Леденящий ужас»\n3.3 Планарный стиль: с 50% шансом заклинание накладывается еще на 1 врага'
                    },
                    'Погребальный колокол':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. Все убитые на момент прочтения поднимаются в виде послушной нежити и служат магу до конца боя, сохраняя свои умения и навыки.\n2.  Маг может вернуть в игру Игрока в виде нежити\n3.1 Эльфийский стиль: переманивает на свою сторону всю враждебную нежить\n3.2 Альдерский стиль: воскрешённые могут стать подкреплением для следующего боя\n3.3 Планарный стиль: до конца боя любой умерший восстает как послушная нежить'
                    }
                }
            },
            'Школа света':{
                'Круг 1':{
                    'Укрепление духа':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. Создает щит, имеющий 2 хп и принимающий на себя следующий урон в первую очередь\n2.  Также +1 сопротивление магии для цели до конца боя\n3.  Бонус сопротивления магии для цели до конца боя увеличен до +2\n4.  ХП щита увеличено с 2 до 4\n5.1 Эльфийский стиль: сопротивление магии увеличено до +3\n5.2 Альдерский стиль: ХП щита увеличено с 4 до 7\n5.3 Планарный стиль: действует на 2 цели'
                    },
                    'Волна света':{
                        'tooltip':'заклинание',
                        'level':'1. 1d4 урона противнику или 1d6 исцеления союзнику\n2.  Действует на всех членов отряда или всех врагов\n3.  1d6 урона противникам или 1d8 исцеления союзникам\n4.  1d8 урона противникам или 1d10 исцеления союзникам\n5.1 Эльфийский стиль: 10 исцеления союзникам\n5.2 Альдерский стиль: снимает с каждого союзника 1 негативный эффект\n5.3 Планарный стиль: по желанию мага заклинание воздействует одновременно и на врагов, и на союзников, но его эффект ослабнет на 50%'
                    }
                },
                'Круг 2':{
                    'Святое слово':{
                        'tooltip':'заклинание',
                        'level':'1. Цель - демон или нежить — получает 1d8 урона\n2.  Действует на всех демонов и нежить в бою\n3.  2d8 урона демонам и нежити\n4.  3d8 урона демонам и нежити\n5.1 Эльфийский стиль: оглушает на 1 ход\n5.2 Альдерский стиль: запрещает нежити/демонам колдовать 1 ход\n5.3 Планарный стиль: заклинание действует сквозь «Защиту от Света», слабее на 50%'
                    },
                    'Оберег':{
                        'tooltip':'заклинание/бафф',
                        'level':'1.  Цель получает +1 хила от всех источников до конца боя\n2.  С цели снимаются все негативные эффекты\n3.  Цель получает +2 хила от всех источников\n4.  Избыточное исцеление цели получает другой раненый союзник\n5.1 Эльфийский стиль: цель получает +3 хила от всех источников\n5.2 Альдерский стиль: дополнительно дает 1 ранг «Стального тела»\n5.3 Планарный стиль: с 50% шансом заклинание накладывается еще на 1 цель'
                    }
                },
                'Круг 3':{
                    'Щит Света':{
                        'tooltip':'заклинание/бафф',
                        'level':'1.  На 3 хода для мага  — полная защита от Тьмы\n2.  Действует на весь отряд\n3.  Исцеляющие эффекты Света увеличены на 3\n4.1 Эльфийский стиль: добавляет +3 брони от магии Тьмы\n4.2 Альдерский стиль: добавляет +2 Уклонения от созданий Тьмы\n4.3 Планарный стиль: длительность до конца боя'
                    },
                    'Святилище':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. Маг создает барьер вокруг союзника, запрещая атаковать и колдовать, блокируя физ. урон. Действует 2 хода\n2.  Также даёт иммунитет от магии\n3.  Барьер действует до конца боя, отменяется по воле мага в ход мага\n4.1 Эльфийский стиль: после снятия «Святилища» оно действует на союзника еще ход, при этом не ограничивая его в действиях\n4.2 Альдерский стиль: может быть наложено на союзника с отложенным действием: активируется в момент получения смертельного урона\n4.3 Планарный стиль: Барьер можно наложить и на противника (бросок сопр.магии на каждый ход), при этом наносит нежити/демонам 1d6 урон, пока действует'
                    }
                },
                'Круг 4':{
                    'Святой запрет':{
                        'tooltip':'заклинание',
                        'level':'1. В течение 2 ходов любая магия, кроме Светлой, наносит  колдующему урон = 50% от количества потраченных ресурсов (прямой урон ХП)\n2.  При чтении любой магии, кроме Светлой, бросается d6, где 1 = неудача заклинания\n3.  Урон = 100% количество потраченных ресурсов\n4.1 Эльфийский стиль: урон наносится только врагам\n4.2 Альдерский стиль: урон Запрета восстанавливает столько же маны Светлым магам\n4.3 Планарный стиль: заклинание действует 4 хода'
                    },
                    'Клинки Света':{
                        'tooltip':'заклинание/бафф',
                        'level':'1.  Следующий удар +5 урона Светом\n2.  Атака против нежити/демонов — без промахов\n3.  Удачный удар клинком снижает уклонение нежити/демонов до 0 до конца боя\n4.1 Эльфийский стиль: действует на всех членов группы\n4.2 Альдерский стиль: следующий удар +10 урона Светом\n4.3 Планарный стиль: действует до конца боя'
                    }
                },
                'Круг 5':{
                    'Воскрешение':{
                        'tooltip':'заклинание',
                        'level':'1. Возвращает к жизни погибшую цель с 1 ХП\n2.  Воскрешает цель с полным запасом ХП, маны и энергии\n3.1 Эльфийский стиль: после воскрешения цель немедленно делает ход\n3.2 Альдерский стиль: после воскрешения цель до конца боя получает «Оберег» максимального уровня альдерского стиля\n3.3 Планарный стиль: с 50% шансом действует еще на 1 погибшего союзника'
                    },
                    'Средоточие Света':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. Маг становится средоточием света: пока он не последний член отряда, оставшийся на ногах – регенерация ХП 10. Действует до конца боя\n2.  +2 регенерация маны и Энергии для мага\n3.1 Эльфийский стиль: способен передать средоточие союзнику, но в этом случае теряет сознание и выбывает из боя\n3.2 Альдерский стиль: пока маг не последний член отряда, оставшийся на ногах – он не может умереть и выбыть из боя.\n3.3 Планарный стиль: аура для группы +2 регенерация маны, ХП и Энергии'
                    }
                }
            },
            'Школа огня':{
                'Круг 1':{
                    'Живой огонёк':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. Сопровождает и освещает путь, маг может его поглотить, восстановив 1d6 ХП и маны\n2.  Перехватывает 1d6 физ.урона направленной на мага атаки, после чего исчезает\n3.  При перехвате атаки взрывается, урон врагам = поглощённый урон\n4.  Огонёк восполняет магу ХП/МП и при взрыве, перехватывает в т.ч. и маг.урон\n5.1 Эльфийский стиль: перехват и урон: 1d12\n5.2 Альдерский стиль: число восстанавливаемых ХП и МП удвоено\n5.3 Планарный стиль: в свой ход маг может самостоятельно взорвать огонёк, при этом не тратит на это ход'
                    },
                    'Защита от Огня':{
                        'tooltip':'заклинание/бафф',
                        'level':'1.  На 1 ход для мага  — снижает урон от стихии на 10\n2.  Снижает ресурсы на применение данной школы на 2\n3.  Действует 2 хода\n4.  Действует до конца боя\n5.1 Эльфийский стиль: дает полную защиту от данной стихии\n5.2 Альдерский стиль: заклинание можно прочитать до начала боя без затрат ресурсов\n5.3 Планарный стиль: действует на весь отряд. При этом наложение на планара, родственного данной стихии, дает полную защиту от данной стихии'
                    }
                },
                'Круг 2':{
                    'Вспышка':{
                        'tooltip':'заклинание',
                        'level':'1.  На 2 хода цель получает штраф -3 к атаке\n2.  Цель лишается бонуса атаки полностью\n3.  Также наносит 1d6 урона\n4.  Также цель теряет бонус Уклонения на 2 хода\n5.1 Эльфийский стиль: действует 4 хода\n5.2 Альдерский стиль: атаки, совершаемые целью, не могут иметь автопопадания\n5.3 Планарный стиль: с 50% шансом действует еще на 1 врага'
                    },
                    'Огненный шар':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. 1d8 урона всем врагам\n2.  Задетые враги горят: 1 урон каждый ход\n3.  1d10 урона всем врагам\n4.  Задетые враги горят: 2 урон каждый ход\n5.1 Эльфийский стиль: при нескольких наложениях «Огненного шара» - урон от горения суммируется\n5.2 Альдерский стиль: каждый ход урон от горения увеличивается на 1\n5.3 Планарный стиль: если враг имеет броню от магии, то горение каждый ход снижает её на число урона от горения'
                    }
                },
                'Круг 3':{
                    'Дух огня':{
                        'tooltip':'заклинание/призыв',
                        'level':'1. Призыв элементаля (I), поддержание - 1 МП/ход\n2.  Призыв элементаля (II), поддержание - 1 МП/ход\n3.  Призыв элементаля (III), поддержание - 1 МП/ход\n4.1 Эльфийский стиль: доп.урон элементаля = сила магии мага\n4.2 Альдерский стиль: мана на поддержание не тратится\n4.3 Планарный стиль: вместо 1 элементаля (III) вызывает 2 элементаля (II). При этом, если заклинание читает планар родной стихии, то 1 из элементалей будет (III)'
                    },
                    'Иссушение':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. Эффективность магии Воздуха снижена на 50%, а также, каждый ход наносит урон элементалям Воздуха в размере 50% их макс. ХП\n2.  Отменяет эффекты заморозки, наложенные на мага и союзников\n3.  Любой наносимый урон огнем увеличен на 2\n4.1 Эльфийский стиль: любой наносимый урон огнем увеличен на 4\n4.2 Альдерский стиль: при наложении заклинаний магии Огня броски на сопротивление им делаются со штрафом -2\n4.3 Планарный стиль: любые цели, находящиеся под эффектом горения, в свой ход с вероятностью 50% получат от него урон 2 раза вместо 1'
                    }
                },
                'Круг 4':{
                    'Пылающая душа':{
                        'tooltip':'заклинание/бафф',
                        'level':'1.  1d6 урона цели (чистый урон ХП), +1d6 к ее атаке в следующем ходу\n2.  Также +1d6 к уклонению цели в следующем ходу\n3.  Также +1d6 к физ.урону цели в следующем ходу\n4.1 Эльфийский стиль: также +1d6 к скорости цели в следующем ходу\n4.2 Альдерский стиль: урон ХП не наносится\n4.3 Планарный стиль: действует 2 хода'
                    },
                    'Огненное оружие':{
                        'tooltip':'заклинание/бафф',
                        'level':'1.  Следующий удар +5 урона Огнём\n2.  50% шанс поджечь цель на 1d6 урон/ход\n3.  100% шанс поджечь цель на 1d6 урон/ход\n4.1 Эльфийский стиль: действует на всю группу\n4.2 Альдерский стиль: следующий удар +10 урона Огнём\n4.3 Планарный стиль: действует до конца боя'
                    }
                },
                'Круг 5':{
                    'Огненная блокада':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. До конца боя цель защищают языки пламени, атакующие цель враги получают 1d10 урона огнём. Цель получает также 1d6 брони от магии\n2.  Урон огнем наносится также стрелкам и магам\n3.1 Эльфийский стиль: накладывает блокаду на 2 цели\n3.2 Альдерский стиль: Цель получает также 1d6 брони и сопротивления магии.\n3.3 Планарный стиль: источник урона атакующим цель врагам – на основе всех 4 стихий, в зависимости от уязвимости атакующего'
                    },
                    'Огненный дождь':{
                        'tooltip':'заклинание',
                        'level':'1.  10d6 огнём всем\n2.  Огненный дождь действует только на врагов\n3.1 Эльфийский стиль: задетые враги горят, получая 3 урона каждый ход\n3.2 Альдерский стиль: урон потоков наполовину физический, наполовину огнём\n3.3 Планарный стиль: источник урона атакующим цель врагам – на основе всех 4 стихий, в зависимости от уязвимости атакующего'
                    }
                }
            },
            'Школа воды':{
                'Круг 1':{
                    'Обезвоживание':{
                        'tooltip':'заклинание',
                        'level':'1.  На 1 ход — штраф -3 к максимуму ХП\n2.  На 1 ход — штраф -5 к максимуму ХП\n3.  Затраты ресурсов на действия увеличены в 2 раза\n4.  Действует 2 хода\n5.1 Эльфийский стиль: действует до конца боя\n5.2 Альдерский стиль: совершение любого действия добавляет -2 к штрафу ХП\n5.3 Планарный стиль: с 50% шансом действует еще на 1 врага'
                    },
                    'Защита от Воды':{
                        'tooltip':'заклинание/бафф',
                        'level':'1.  На 1 ход для мага  — снижает урон от стихии на 10\n2.  Снижает ресурсы на применение данной школы на 2\n3.  Действует 2 хода\n4.  Действует до конца боя\n5.1 Эльфийский стиль: дает полную защиту от данной стихии\n5.2 Альдерский стиль: заклинание можно прочитать до начала боя без затрат ресурсов\n5.3 Планарный стиль: действует на весь отряд. При этом наложение на планара, родственного данной стихии, дает полную защиту от данной стихии'
                    }
                },
                'Круг 2':{
                    'Ледяная хватка':{
                        'tooltip':'заклинание',
                        'level':'1.  Скорость цели снижается на 3 до конца боя. Можно применять несколько раз.\n2.  Действует на всех врагов\n3.  Если при этом скорость ушла в минус, то 1d6 урона водой\n4.  Штраф к любым броскам равен половине штрафа к скорости (если она в минусе)\n5.1 Эльфийский стиль: если цель в свой ход не совершает активных действий (магия, атака), то замерзает насмерть\n5.2 Альдерский стиль: при успешном наложении, повторное применение заклинания игнорирует сопротивление магии\n5.3 Планарный стиль: к урону «Хватки» добавляется значение штрафа скорости'
                    },
                    'Ржавчина':{
                        'tooltip':'заклинание',
                        'level':'1.  Лишает 2 ед. брони цель, носящую на себе доспехи или щит\n2.  Действует на всех врагов\n3.  Также при наложении  -2 физ.урона цели, держащей в руках оружие ближнего боя\n4.  Снижение увеличено с -2 до -4\n5.1 Эльфийский стиль: для каждого противника маг оперирует штрафом -8 и сам выбирает, снизить урон или броню.\n5.2 Альдерский стиль: вместо обычного эффекта маг влияет на оружие противника так, что при ударе оно с 50% шансом сломается, оставив врага с голыми руками\n5.3 Планарный стиль: маг может наложить заклинание не только на гуманоидов, а даже на существ, имеющих врожденный урон и броню'
                    }
                },
                'Круг 3':{
                    'Ливень':{
                        'tooltip':'заклинание/погода',
                        'level':'1. До конца боя все стрелки теряют бонус к атаке\n2.  Эффективность магии Огня снижена на 50%, а также, каждый ход наносит урон элементалям Огня в размере 50% их макс. ХП\n3.  Отменяет эффекты горения, наложенные на союзников\n4.1 Эльфийский стиль: негативные эффекты «Ливня» действуют только на врагов, если в их числе есть стрелки, то они не могут стрелять – только ближний бой\n4.2 Альдерский стиль: все участники боя становятся  проводниками, в результате чего урон от молний увеличен на 100%\n4.3 Планарный стиль: во время «Ливня» призванные элементали Воды получают автопопадание при любой своей атаке, а на их поддержание не тратится мана'
                    },
                    'Дух воды':{
                        'tooltip':'заклинание/призыв',
                        'level':'1.  Призыв элементаля (I), поддержание - 1 МП/ход\n2.  Призыв элементаля (II), поддержание - 1 МП/ход\n3.  Призыв элементаля (III), поддержание - 1 МП/ход\n4.1 Эльфийский стиль: доп.урон элементаля = сила магии мага\n4.2 Альдерский стиль: мана на поддержание не тратится\n4.3 Планарный стиль: вместо 1 элементаля (III) вызывает 2 элементаля (II). При этом, если заклинание читает планар родной стихии, то 1 из элементалей будет (III)'
                    }
                },
                'Круг 4':{
                    'Ледяной конус':{
                        'tooltip':'заклинание',
                        'level':'1. 1d12 урона цели\n2.  На 1 ход — штраф -5 к максимуму ХП\n3.  Затраты Энергии на действия цели увеличены на 2\n4.1 Эльфийский стиль: цель становится настолько хрупкой, что в течение действия заклинания удачный Сильный удар – разбивает её насмерть\n4.2 Альдерский стиль: штраф -5 к максимуму ХП - до конца боя (не суммируется)\n4.3 Планарный стиль: при поражении осколки льда наносят урон остальным врагам в размере 50% урона основной цели'
                    },
                    'Клинки мороза':{
                        'tooltip':'заклинание/бафф',
                        'level':'1.  Следующий удар +5 урона льдом\n2.  -2 к скорости пораженной цели до конца боя\n3.  -4 к скорости пораженной цели до конца боя\n4.1 Эльфийский стиль: действует на всех членов группы\n4.2 Альдерский стиль: следующий удар +10 урона льдом\n4.3 Планарный стиль: действует до конца боя'
                    }
                },
                'Круг 5':{
                    'Магическое зеркало':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. Из воды образуется зеркало, возвращая обратно следующее направленное в мага заклинание, при этом не воздействуя на мага.\n2.  Будучи целью нескольких заклинаний маг может выбрать, какая именно магия отражается.\n3.1 Эльфийский стиль: на время боя маг пополняет набор своей магии отражённым заклинанием, которое остаётся с ним и после боя, если есть место в книге\n3.2 Альдерский стиль: маг может отразить 2 заклинания вместо 1\n3.3 Планарный стиль: если маг задет заклинанием массового поражения, «Зеркало» не убережёт мага от урона, но полностью отразит эффекты магии на всех врагов'
                    },
                    'Объятья льда':{
                        'tooltip':'заклинание',
                        'level':'1. На 1d6 ходов все в бою, кроме мага, замерзают и пропускают свои ходы\n2.  Урон от Воды по задетым «Объятьями» целям - удвоен\n3.1 Эльфийский стиль: «Объятья» действуют только на врагов\n3.2 Альдерский стиль: вокруг мага формируется ледяной доспех с 4 ХП,+4 ХП за каждый ход действия заклинания, способный принимать в себя прямой урон\n3.3 Планарный стиль: «Объятья» действуют 1d10 ходов'
                    }
                }
            },
            'Школа природы':{
                'Круг 1':{
                    'Власть природы':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. Дает магу и отряду полную защиту от Природы на 2 хода\n2.  +2 скорость отряда на открытой местности до конца боя\n3.  Призывает стаю диких зверьков помогать 1 ход. Зверьки и их способности определяются средой, в которой были вызваны\n4.  Враждебные животные не нападают на членов группы под «Властью природы», только если герои сами не проявляют агрессию. Если против мага только животные, это позволяет закончить бой\n5.1 Эльфийский стиль: защита от Природы действует до конца боя\n5.2 Альдерский стиль: враждебные животные переходят на сторону мага и атакуют иных его противников, если маг и его группа не проявляют к животным агрессии\n5.3 Планарный стиль: стая диких зверьков помогает магу 2 хода'
                    },
                    'Дикий облик':{
                        'tooltip':'заклинание',
                        'level':'1.  Превращение в животного (I), отмена по воле мага, не тратит ход\n2.  Понимание и умение общаться на язык животных\n3.  Превращение в животного (II), отмена по воле мага, не тратит ход\n4.  Превращение в животного (III), отмена по воле мага, не тратит ход\n5.1 Эльфийский стиль: маг добавляет показатель своей Силы магии к скорости, атаке, защите и урону животного\n5.2 Альдерский стиль: если животное получает смертельный урон, то маг не умирает, а возвращается в свою обычную форму с 1 ХП\n5.3 Планарный стиль: по желанию мага урон в бою животное наносит магией, вместо физического урона'
                    }
                },
                'Круг 2':{
                    'Дикая лоза':{
                        'tooltip':'заклинание',
                        'level':'1. Лоза опутывает цель, не давай перемещаться и нанося 1d6 физ.урона/ход. Каждый ход враг пытается перебросить лозу (без траты хода), при успехе – лоза исчезает, и урон не наносится\n2.  Маг может призвать лозу в выбранную точку, в этом случае она занимает клетку на поле боя (уничтожается 1 атакой) и атакует ближайшего врага\n3.  Также лоза наносит 1d6 урона/ход Природой\n4.  Если враг не перебросит лозу, то пропускает хода\n5.1 Эльфийский стиль: лозы опутывают всех врагов\n5.2 Альдерский стиль: наложение нескольких лоз на одного врага наносит суммированный урон, а не отдельный для каждой из лоз\n5.3 Планарный стиль: если враг не перебросит лозу, то следующий бросок делает со штрафом -2. При провале трёх бросков - лоза задушит врага насмерть.'
                    },
                    'Руки-змеи':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. Руки мага до отмены по воле мага превращаются в змей, кусающих врага (нельзя колдовать, атака+2, урон 2-3-4, яд 1). Атаковать змеями можно сразу после прочтения\n2.  2 атаки за ход\n3.  Физ.урон увеличен в зависимости от наивысшего параметра силы магии или ближнего боя мага\n4.  Урон от яда 3\n5.1 Эльфийский стиль: маг может читать другие заклинания во время действия «Рук»\n5.2 Альдерский стиль: атаки руками-змеями имеют автопопадание\n5.3 Планарный стиль: урон от яда 5'
                    }
                },
                'Круг 3':{
                    'Кожа-кора':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. Маг обрастает корой и становится деревцем: пропуск 2 ходов, но +8 броня +4 реген ХП/маны. Получаемый урон от огня +50%\n2.  Возможность колдовать во время действия\n3.  Кора отбивает первую физ.атаку в каждом ходу\n4.1 Эльфийский стиль: если маг единственный в отряде, то он настолько ловко притворяется деревцем, что враги с 50% шансом потеряют его из виду и уйдут\n4.2 Альдерский стиль: иммунитет к любой магии, кроме Огня\n4.3 Планарный стиль: по окончанию действия заклинания на ближайшего противника накладывается «Дикая лоза»'
                    },
                    'Исцеляющий дух':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. Дух доброго зверька помогает магу до конца боя, исцеляя 1d6 здоровья одной цели каждый ход\n2.  Дополнительно восстанавливает 1 Энергию и 1 ману\n3.  Исцеляет 1d10 здоровья 1 цели каждый ход\n4.1 Эльфийский стиль: Снимает 1 негативный эффект\n4.2 Альдерский стиль: исцеляет 10 здоровья 1 цели каждый ход\n4.3 Планарный стиль: +2 сопротивление магии для исцеляемой цели до конца боя'
                    }
                },
                'Круг 4':{
                    'Круг грибов':{
                        'tooltip':'заклинание',
                        'level':'1. Окружает цель не крупнее гуманоида, не давая перемещаться и атаковать, но и скрывая от атак. 2 атаки по кругу для уничтожения\n2.  При атаке взрываются грибы — 1d6 урона Природой врагам\n3.  Урон от грибов отравляет ядом врагов - яд 2\n4.1 Эльфийский стиль: после уничтожения из круга с вероятностью 50% выйдет разумный гриб и будет помогать магу до конца боя\n4.2 Альдерский стиль: 4 атаки по кругу для уничтожения\n4.3 Планарный стиль: при взрыве грибов яд 4'
                    },
                    'Заражение':{
                        'tooltip':'заклинание',
                        'level':'1. Цель заболевает лихорадкой, её атака и физ.урон снижен на 3\n2.  Штраф -3 теперь действует на любые броски\n3.  Любой получаемый урон увеличен на 3\n4.1 Эльфийский стиль: цель не может читать заклинания\n4.2 Альдерский стиль: При получении урона цель оглушается на 1 ход\n4.3 Планарный стиль: с вероятностью 50% лихорадкой заболевает еще 1 цель'
                    }
                },
                'Круг 5':{
                    'Гроза гнева':{
                        'tooltip':'заклинание/погода',
                        'level':'1.  Каждый ход кислотный дождь бьет всех врагов на 1d12 Природой\n2.  Кислотный дождь к.ход снижает врагам броню на 3\n3.1 Эльфийский стиль: гроза искажает магические возможности так, что все вражеские маги в бою с вероятностью 50% провалят чтение своего заклинания\n3.2 Альдерский стиль: выпадает град, нанося всем 1d12 физ.урона каждый ход\n3.3 Планарный стиль: природный урон игнорирует броню от магии'
                    },
                    'Защита от Энергии':{
                        'tooltip':'заклинание/бафф',
                        'level':'1.  Снижение урона от выбранной стихии на 10 до конца боя для всех союзников\n2.  Дает полный иммунитет к данной стихии\n3.1 Эльфийский стиль: маг может отказаться от эффекта иммунитета к стихии, в этом случае союзники получат броню 10 от всех 4 стихий.\n3.2 Альдерский стиль: при произнесении этого заклинания оно с вероятностью 50% не потребует трат ресурсов\n3.3 Планарный стиль: можно выбрать 2 типа стихии'
                    }
                }
            },
            'Школа земли':{
                'Круг 1':{
                    'Град камней':{
                        'tooltip':'заклинание',
                        'level':'1. Маг зачаровывает 2 камня и метает их во врагов, каждый наносит 1d6 физического урона. На это заклинание не действует сопротивление магии, однако, от них можно уклониться – со стороны мага камни метаются с броском +3.\n2.  Зачарованные камни имеют игнор брони 2\n3.  Каждый камень наносит 1d8 физического урона\n4.  Зачарованные камни имеют игнор брони 4\n5.1 Эльфийский стиль: от камней нельзя уклониться\n5.2 Альдерский стиль: если оба камня успешно попали в 1 и ту же цель, она оглушается на 1 ход.\n5.3 Планарный стиль: маг может отказаться от бонуса +3 к броску своих камней, и зачаровать 5 камней вместо 2'
                    },
                    'Защита от Земли':{
                        'tooltip':'заклинание/бафф',
                        'level':'1.  На 1 ход для мага  — снижает урон от стихии на 10\n2.  Снижает ресурсы на применение данной школы на 2\n3.  Действует 2 хода\n4.  Действует до конца боя\n5.1 Эльфийский стиль: дает полную защиту от данной стихии\n5.2 Альдерский стиль: заклинание можно прочитать до начала боя без затрат ресурсов\n5.3 Планарный стиль: действует на весь отряд. При этом наложение на планара, родственного данной стихии, дает полную защиту от данной стихии'
                    }
                },
                'Круг 2':{
                    'Твердость камня':{
                        'tooltip':'заклинание/бафф',
                        'level':'1.  Цель до конца боя получает иммунитет к оглушению и снижению скорости, но эффект снимается, если цель передвигается на другую клетку\n2.  Также эффекты Яда/Кровотечения/Болезни не действуют\n3.  Также заземление — урон от молнии снижен на 50%\n4.  Цель получает доп. 1 ранг «Стального тела»\n5.1 Эльфийский стиль: цель может передвигаться с сохранением чар\n5.2 Альдерский стиль: цель не получает Сильных ударов\n5.3 Планарный стиль: урон от всех стихий снижен на 50%'
                    },
                    'Песчаная буря':{
                        'tooltip':'заклинание/погода',
                        'level':'1.  Каждый ход все теряют по -1 к атаке, вплоть до 0\n2.  Штраф для стрелков удвоен\n3.  Эффективность магии Воды снижена на 50%, а также, каждый ход наносит урон элементалям Воды в размере 50% их макс. ХП\n4.  Эффект действует только на врагов\n5.1 Эльфийский стиль: каждый ход враги также теряют по -1 скорости, вплоть до 0\n5.2 Альдерский стиль: снижает любой урон от молний на 50%\n5.3 Планарный стиль: во время действия «Бури» призыв элементаля земли стоит в 2 раза дешевле, а на его поддержание не тратится мана'
                    }
                },
                'Круг 3':{
                    'Каменный доспех':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. До конца боя +3 брони/-3 скорости, каждый удар снижает бонус на 1\n2.  Бонус брони не снижается от ударов\n3.  До конца боя +6 брони/-6 скорости\n4.1 Эльфийский стиль: нет штрафа на скорость\n4.2 Альдерский стиль: цель также получает «Твердость камня»\n4.3 Планарный стиль: можно наложить на 2 цели'
                    },
                    'Дух земли':{
                        'tooltip':'заклинание/призыв',
                        'level':'1. Призыв элементаля (I), поддержание - 1 МП/ход\n2.  Призыв элементаля (II), поддержание - 1 МП/ход\n3.  Призыв элементаля (III), поддержание - 1 МП/ход\n4.1 Эльфийский стиль: доп.урон элементаля = сила магии мага\n4.2 Альдерский стиль: мана на поддержание не тратится\n4.3 Планарный стиль: вместо 1 элементаля (III) вызывает 2 элементаля (II). При этом, если заклинание читает планар родной стихии, то 1 из элементалей будет (III)'
                    }
                },
                'Круг 4':{
                    'Каменный кулак':{
                        'tooltip':'заклинание',
                        'level':'1. 1d12 физического урона цели\n2.  Если урон пробил броню, цель оглушена на 1 ход\n3.  Цель теряет 50% брони на 1 ход\n4.1 Эльфийский стиль: маг может изменить тип урона на «Земля» с сохранением остальных эффектов\n4.2 Альдерский стиль: 1d20 физического урона цели\n4.3 Планарный стиль: если урон пробил и оглушил цель, то враги рядом с ним получают 50% нанесенного урона и теряют 50% брони на 1 ход'
                    },
                    'Оружие камнедробителя':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. Следующий удар +5 физ.урона\n2. +3 игнор брони при ударе\n3. +6 игнор брони при ударе\n4.1 Эльфийский стиль: действует на всех членов группы\n4.2 Альдерский стиль: следующий удар +10 физ.урона\n4.3 Планарный стиль: действует до конца боя'
                    }
                },
                'Круг 5':{
                    'Руки гор':{
                        'tooltip':'заклинание',
                        'level':'1. Цель сжимают каменные ладони, оглушая на 2 хода\n2.  Каждый ход ладони ломают 5 брони цели\n3.1 Эльфийский стиль: длительность 4 хода\n3.2 Альдерский стиль: с вероятностью 25% ладони раздавят цель насмерть\n3.3 Планарный стиль: при наложении ладони с шансом 50% схватят 2 цели вместо 1'
                    },
                    'Плоть в камень':{
                        'tooltip':'заклинание',
                        'level':'1. Превращает врага в каменное изваяние на 2 хода. Враг пропускает 2 хода, но получает иммунитет к физ.урону\n2.  По окончанию действия цель теряет всю ману/энергию\n3.1 Эльфийский стиль: каменная статуя настолько хрупкая, что разобьется насмерть при сильном ударе\n3.2 Альдерский стиль: повторное наложение заклинания на окаменевшую цель – превратит в статую навеки\n3.3 Планарный стиль: заклинание игнорирует сопротивление магии'
                    }
                }
            },
            'Школа воздуха':{
                'Круг 1':{
                    'Ускорение':{
                        'tooltip':'заклинание/бафф',
                        'level':'1.  На 1 ход цель получает +2 скорости\n2.  Затраты Энергии на действия снижены на 1 (вплоть до 0)\n3.  На 1 ход цель получает +4 скорости\n4.  Действует до конца боя\n5.1 Эльфийский стиль: цель получает +6 скорости\n5.2 Альдерский стиль: цели заклинания игнорируют проверки, чтобы сбежать из боя\n5.3 Планарный стиль: действует на всю группу'
                    },
                    'Защита от Воздуха':{
                        'tooltip':'заклинание/бафф',
                        'level':'1.  На 1 ход для мага  — снижает урон от стихии на 10\n2.  Снижает ресурсы на применение данной школы на 2\n3.  Действует 2 хода\n4.  Действует до конца боя\n5.1 Эльфийский стиль: дает полную защиту от данной стихии\n5.2 Альдерский стиль: заклинание можно прочитать до начала боя без затрат ресурсов\n5.3 Планарный стиль: действует на весь отряд. При этом наложение на планара, родственного данной стихии, дает полную защиту от данной стихии'
                    }
                },
                'Круг 2':{
                    'Доспех штормов':{
                        'tooltip':'заклинание/бафф',
                        'level':'1.  +2 к Уклонению цели на 2 хода\n2.  +2 броня от магии\n3.  +4 к Уклонению цели на 2 хода\n4.  +4 броня от магии\n5.1 Эльфийский стиль: действует на всю группу\n5.2 Альдерский стиль: каждый ход цель получает Защиту от случайной стихии. Тип выбирается случайно, но за исключением уже наложенных Защит\n5.3 Планарный стиль: действует до конца боя'
                    },
                    'Клинок Ветров':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. Невесомый одноручный клинок из воздуха заменяет оружие мага до конца боя: физ.урон 2-4-7, нет затрат Энергии на атаку. Не работают модификаторы физ.урона.\n2.  +3 к атаке Клинком Ветров\n3.  Можно атаковать любую цель в бою\n4.  Урон Клинка Ветров 4-6-10\n5.1 Эльфийский стиль: +10 к атаке Клинком Ветров\n5.2 Альдерский стиль: работают модификаторы физ.урона и атаки\n5.3 Планарный стиль: урон может быть изменен с физического на Воздух'
                    }
                },
                'Круг 3':{
                    'Разряд молнии':{
                        'tooltip':'заклинание',
                        'level':'1. 1d6 каждой цели, +1 к урону за каждую пораженную цель, кроме первой\n2.  Игнорирует 5 брони от магии у поражаемых целей\n3.  Увеличивает следующий урон любой магией по пораженным целям на 2\n4.1 Эльфийский стиль: увеличивает следующий урон любой магией по пораженным целям на 5\n4.2 Альдерский стиль: 1d10 каждой цели\n4.3 Планарный стиль: полный игнор брони от магии у поражаемых целей'
                    },
                    'Дух воздуха':{
                        'tooltip':'заклинание/призыв',
                        'level':'1.  Призыв элементаля (I), поддержание - 1 МП/ход\n2.  Призыв элементаля (II), поддержание - 1 МП/ход\n3.  Призыв элементаля (III), поддержание - 1 МП/ход\n4.1 Эльфийский стиль: доп.урон элементаля = сила магии мага\n4.2 Альдерский стиль: мана на поддержание не тратится\n4.3 Планарный стиль: вместо 1 элементаля (III) вызывает 2 элементаля (II). При этом, если заклинание читает планар родной стихии, то 1 из элементалей будет (III)'
                    }
                },
                'Круг 4':{
                    'Магический вихрь':{
                        'tooltip':'заклинание/погода',
                        'level':'1. До конца боя все цели тратят +2 маны на магию. 50% потраченной таким образом маны возвращается к сотворившему «Вихрь» магу\n2.  Эффективность магии Земли снижена на 50%, а также, каждый ход наносит урон элементалям Земли в размере 50% их макс. ХП\n3.  Действует только на врагов, а штраф затрат маны увеличен до +4\n4.1 Эльфийский стиль: потраченная врагами штрафная мана возвращается к сотворившему «Вихрь» в полном объёме\n4.2 Альдерский стиль: 50% потраченной врагами штрафной маны также увеличивает следующий прямой магический урон для заклинания мага, сотворившего «Вихрь»\n4.3 Планарный стиль: во время «Вихря» призванные элементали Воздуха получают автопопадание при любой своей атаке, а на их поддержание не тратится мана'
                    },
                    'Громовое оружие':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. Следующий удар +5 урона Воздухом\n2.  50% шанс дублировать доп.урон соседнему врагу\n3.  Цель успешного удара не использует способности или магию 1 ход\n4.1 Эльфийский стиль: действует на всех членов группы\n4.2 Альдерский стиль: следующий удар +10 урона Воздухом\n4.3 Планарный стиль: действует до конца боя'
                    }
                },
                'Круг 5':{
                    'Левитация':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. Маг парит над полем боя и недосягаем для большинства врагов ближнего боя и заклинаний массового поражения, направленных на остальную группу. Поддержание 2. Возможно прочтение «Левитации» до начала боя даже при отсутствии тактического преимущества, а также выход из боя, если маг недосягаем для врагов.\n2.  По окончанию маг приземляется в любое место боя\n3.1 Эльфийский стиль: затраты на произнесение магии Воздуха во время левитации снижены на 2 маны, а на любое поддержание снижено на 1\n3.2 Альдерский стиль: при нахождении в левитации маг автоматически получает на себе эффект заклинания «Доспех штормов»\n3.3 Планарный стиль: маг может наложить левитацию на союзника, но поддержание при этом стоит 3 вместо 2 маны'
                    },
                    'Молния-лассо':{
                        'tooltip':'заклинание',
                        'level':'1. Маг связывает цель электрической цепью, заставляя её пропускать свой ход и получать 1d10 урона каждый ход. Поддержание стоит 2 маны и траты хода мага.\n2.  Заклинание не прерывается, если маг получает эффект контроля, но всё так же требует маны на поддержку\n3.1 Эльфийский стиль: эффект связывания действует даже на имунные к магии цели, или цели под Защитой от воздуха\n3.2 Альдерский стиль: цель получает 10 урона каждый ход\n3.3 Планарный стиль: маг может связать 2 цели вместо 1, однако, поддержание в этом случае стоит 4 маны/ход'
                    }
                }
            },
            'Школа хаоса':{
                'Круг 1':{
                    'Взрыв разума':{
                        'tooltip':'заклинание',
                        'level':'1. Выбранная цель до конца боя теряет 1d6 случайного параметра: макс. ХП/скорость/атака/уклонение.\n2. Сотворивший «Взрыв» получает бонус +50% от сниженного параметра\n3. Число штрафа к параметру также наносится в виде урона цели магией Тьмы\n4. Штраф получают все параметры: макс. ХП/скорость/атака/уклонение.\n5. Штраф увеличен с 1d6 до 1d12'
                    },
                    'Очернение рассудка':{
                        'tooltip':'заклинание',
                        'level':'Поддержание: 1\n1. Если цель собирается совершить действие из перечисленных: атака, магия, манёвр, особая способность или небоевое действие, то с вероятностью 50% она забудет, что хотела сделать, и вынуждена будет действовать по-другому\n2.Маг может увеличить затраты на поддержание до 2, в этом случае шанс срабатывания 100%\n3. Цель с вероятностью 50% (100% с увеличением затрат) пропускает свой ход полностью\n4.Маг может увеличить затраты на поддержание до 3, взять цель под контроль и управлять ею\n5. Маг может удвоить затраты на поддержание, очернив рассудок сразу 2 целей'
                    }
                },
                'Круг 2':{
                    'Приказ Хаоса':{
                        'tooltip':'заклинание',
                        'level':'1. Два случайных участника боя меняются параметрами атаки и уклонения на 1 ход\n2.Также меняются наложенными на них эффектами, как позитивными, так и негативными\n3. Маг, прочитавший «Приказ», может получить только более высокие параметры и только позитивные эффекты, при этом последние не возвращает по окончанию хода, оставляя себе\n4.Маг по желанию может увеличить число ходов действия «Приказа» в зависимости от своей силы магии\n5. Маг может выбрать, кто именно меняется параметрами'
                    },
                    'Безумные мысли':{
                        'tooltip':'заклинание',
                        'level':'1. До конца боя цель при использовании атак и магии, тратит вместо обычных ресурсов – своё ХП\n2.Цель вынуждена также тратить и основные ресурсы\n3. Если цель использует особые способности и магию, наносящие урон в одну цель, то с вероятностью 50% нанесёт себе половину причинённого урона. Если урон направлен в мага, прочитавшего «Безумные мысли», то урон по себе наносится полностью\n4.Если цель получает исцеление, то с шансом 50% она получит урон вместо исцеления\n5. Также если цель использует особые способности и магию, наносящие урон по площади, то с вероятностью 50% нанесёт себе и своим союзникам половину причинённого урона'
                    }
                },
                'Круг 3':{
                    'Искажение реальности':{
                        'tooltip':'заклинание',
                        'level':'Поддержание: 1\n1. Каждый ход маг выплёскивает хаотическую энергию, в результате у всех в бою все атаки имеют 50% шанс промахнуться (бросок перед атакой), а магия 50% шанс не сработать\n2.Маг может увеличить затраты на поддержание до 2/ход или3/ход, в этом случае шансы искажения увеличены до 75% или 100% соответственно\n3.Затраты на поддержание становятся уроном Тьмой, который получают все враги мага\n4. Урон Тьмой от поддержания игнорирует броню от магии'
                    },
                    'Хаотический разлом':{
                        'tooltip':'заклинание',
                        'level':'1. Маг открывает хаотический разлом, который будет существовать до конца боя. Каждый ход разлом случайно производит эффект: бросок d12, из которых:\n1-4: все участники боя получают 1d10 урон магией Тьмы\n5-6:все враги получают 1d10 урон магией Тьмы\n7-8: в случайной точке поля боя появляется элементаль Хаоса, который случайным образом выбирает цели для атаки. Если на поле боя нет места, элементаль не появляется, а все участники боя получают 1d12 урон Тьмой\n9-10: все участники боя теряют 1d10 маны\n11: все участники боя восполняют 1d10 маны\n12:все союзники мага получают «Защиту от Тьмы» до конца боя\n2.Маг не получает негативных эффектов и урон от «Разлома» а также, способен контролировать элементаля и выбирать место его призыва\n3.Если разлом исторгает 1d10 урон магией Тьмы, маг может зачерпнуть его и прибавить к следующему своему заклинанию, наносящему урон\n4. Каждый ход хаотический разлом увеличивает силу магии мага на 1'
                    }
                },
                'Круг 4':{
                    'Управление Хаосом':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. До конца боя маг каждый ход выбирает значение одного броска/ход, совершенного кем угодно\n2.Маг также способен 1 раз за бой отменить любое прочитанное заклинание\n3.Каждый предрешённый бросок и каждое отмененное заклинание увеличивают силу магии мага на 1\n4. Число возможностей отменить заклинание и выбирать значение броска увеличено до 2'
                    },
                    'Присутствие Хаоса':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. До конца боя маг и его союзники получают +2 к броне от магии и +2 реген ХП, а противники -2 к броне от магии и -2 реген ХП (при наличии)\n2.Если открыт хаотический разлом, то бонусы и штраф увеличены до +4/-4\n3.Бонус лично для мага увеличен до +8, если открыт хаотический разлом\n4. В присутствии мага противники не могут применять свои специальные способности'
                    }
                },
                'Круг 5':{
                    'Правление Хаоса':{
                        'tooltip':'заклинание/бафф',
                        'level':'1. Каждое произнесенное заклинание Хаоса до конца боя увеличивает магу броню, броню от магии и сопротивление магии на +3\n2.Каждое произнесенное заклинание Хаоса в бою также снижает сопротивление магии врагов на -3. Если у врага имеется иммунитет к магии, то он считается за бросок +10, и после первого хода действия «Правления Хаоса» становится +7, и т.д.\n3.Каждое произнесенное заклинание открывает хаотический разлом. Урон хаотических разломов увеличен на 50%'
                    },
                    'Взгляд в Бездну':{
                        'tooltip':'заклинание',
                        'level':'1. Маг вглядывается в созданный им хаотический разлом и до конца боя получает возможность тратить на заклинания свои случайные параметры, если Энергия и Мана закончились.\n2.Бездна наполняет мага «Пониманием», в результате чего моментально происходит прочтение двух случайных других заклинаний Хаоса без затрат ресурсов\n3.Если при срабатывании «Понимания» выпадут 2 одинаковых заклинания, то произойдёт детонация хаоса, которая производит в мире страшные разрушения, а в бою - наносит 50 урона Тьмой всем, кроме мага, который укроется в хаотическом разломе'
                    }
                }
            }
        }
}
